numb = [11, 348, 3, 5, 6, 18, 20]


count_elements = 0
for _ in numb:   # "_" - конкрет елем, перебираємо
    count_elements += 1

sum_elements = sum(numb)

max_r = max(numb, default=0, key=lambda x: float(x) / (float(x) + 1))  # список порожній, відношення для всіх елементів 0, -> "max()" повинно повернути 0
# "key=lambda x: x / (x + 1)": ключовий аргумент, він приймає функцію, яка визначає, як сортувати елементи (відношення)
# відношення (частка) для кожного елементу у списку - "lambda x: x / (x + 1)"


print("к-сть елементів у списку:", count_elements)
print("сума елементів у списку:", sum_elements)
print("знач найбільш відношення (частки) серед елементів:", max_r)
